benchmark-results/round-3-intel-full-atillery/dragonfly - 16.txt
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      4300722.66          ---          ---         0.35275         0.33500         0.45500         0.50300         0.63900         0.79900         1.50300         1.63100        17.91900        21.24700    285128.71 
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    4300722.66         0.00         0.00         0.35275         0.33500         0.45500         0.50300         0.63900         0.79900         1.50300         1.63100        17.91900        21.24700    285128.71 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       473490.61          ---          ---         0.32235         0.30300         0.42300         0.47900         0.60700         0.75100         1.06300         1.15900         1.36700         2.12700     31439.85 
Gets      4734854.03     26143.67   4708710.36         0.32214         0.30300         0.42300         0.47900         0.60700         0.75100         1.05500         1.15900         1.35900         2.12700    190107.05 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    5208344.64     26143.67   4708710.36         0.32216         0.30300         0.42300         0.47900         0.60700         0.75100         1.05500         1.15900         1.35900         2.12700    221546.90 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       110834.52          ---          ---         0.15664         0.15900         0.18300         0.19900         0.31100         0.41500         0.53500         0.67900         0.92700         1.44700      7359.31 
Gets      1108198.96      6534.02   1101664.94         0.15584         0.15900         0.18300         0.19900         0.31100         0.40700         0.51100         0.62300         0.84700         1.02300     44503.40 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1219033.48      6534.02   1101664.94         0.15591         0.15900         0.18300         0.19900         0.31100         0.41500         0.51900         0.62300         0.86300         1.44700     51862.72 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       407914.36          ---          ---         0.35108         0.33500         0.45500         0.50300         0.63100         0.77500         1.05500         1.15100         1.51100         2.15900     27043.91 
Gets      4079098.75   4079098.75         0.00         0.35093         0.33500         0.45500         0.50300         0.63100         0.77500         1.05500         1.14300         1.51900         2.17500    250517.99 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    4487013.11   4079098.75         0.00         0.35095         0.33500         0.45500         0.50300         0.63100         0.77500         1.05500         1.14300         1.51900         2.17500    277561.90 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       122888.49          ---          ---         0.14078         0.14300         0.16700         0.17500         0.26300         0.37500         0.53500         0.67100         1.31900         3.27900      8146.91 
Gets      1228722.75   1228722.75         0.00         0.14047         0.14300         0.16700         0.17500         0.26300         0.37500         0.48700         0.59900         0.84700         2.25500     75461.51 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1351611.25   1228722.75         0.00         0.14050         0.14300         0.16700         0.17500         0.26300         0.37500         0.48700         0.60700         0.86300         3.27900     83608.42